{
  "tooltips": {
    "settings": {
      "settings": "Ustawienia",
      "language": "Wybierz język",
      "theme": "Zmień widok",
      "light": "jasny",
      "dark": "ciemny"
    }
  },
  "nav": {
    "sections": {
      "home": "Witaj",
      "about": "O mnie",
      "skills": "Umiejętności",
      "work": "Portfolio",
      "contact": "Kontakt"
    }
  },
  "sections": {
    "home": {
      "header": {
        "p1": "Cześć! Nazywam się",
        "p2": "Jestem web developerem z prawie dwuletnim doświadczeniem komercyjnym.",
        "p3": "Zapraszam Cię do dalszego poznania moich ",
        "p4": ", aby uzyskać kompleksowy obraz moich "
      },
      "links": {
        "skills": "umiejętności",
        "projects": "projektów"
      }
    },
    "about": {
      "headers": {
        "experience": "Doświadczenie",
        "bootcamps": "Bootcampy i kursy",
        "positions": "Wcześniejsze stanowiska",
        "usedTech": "Technologie, z których korzystałem:"
      },
      "experience": {
        "shiftana": {
          "position": "Junior Frontend developer",
          "from": "Wrzesień 2023",
          "to": "obecnie",
          "duties": {
            "duty1": "Budowanie warstwy front-end aplikacji umożliwiającej szczegółowe zarządzanie harmonogramem pracy, dostępnością pracowników oraz raportowaniem wykonanej pracy. ",
            "duty2": "Tworzenie z otrzymanych w Figmie projektów w pełni funkcjonalnych widoków i komponentów, dbając o perfekcyjne odwzorowanie i jakość użytkowania aplikacji.",
            "duty3": "Tworzenie testów jednostkowych przy użyciu React Testing Library i Jest, ",
            "duty4": "Automatyzowałem proces wdrażania standardów kodowania za pomocą GitLab CI/CD i ESLint, co przyczyniało się do usprawnienia przepływów pracy.",
            "duty5": "Praca w środowisku opartym na metodologii Agile, aktywne uczestniczenie w przeglądach kodu, planowaniu sprintów i ciągłym rozwijaniu funkcji aplikacji."
          }
        },
        "givemeart": {
          "position": "Junior Frontend Developer / Designer - Freelance",
          "from": "Lipiec 2023",
          "to": "Październik 2023",
          "duties": {
            "duty1": "Projektowanie UX/UI aplikacji: Tworzenie intuicyjnych i estetycznych interfejsów użytkownika w celu zapewnienia maksymalnej funkcjonalności i łatwości obsługi aplikacji.",
            "duty2": "Tworzenie design systemu w Figmie, który umożliwiał standaryzację elementów UI i zapewniał spójność wizualną i techniczną produktu.",
            "duty3": "Budowanie responsywnych interfejsów użytkownika przy użyciu Next.js i Tailwind CSS, co obejmuje zarządzanie stanem aplikacji, routing oraz optymalizację pod kątem SEO.",
            "duty4": "Współpraca z zespołem i udział w spotkaniach z klientem, aby zrozumieć wymagania dotyczące interfejsu użytkownika i funkcjonalności aplikacji.",
            "duty5": "Tworzenie i utrzymanie dokumentacji technicznej w celu ułatwienia zarządzania projektem oraz przyszłych prac nad aplikacją"
          }
        },
        "trenujemy": {
          "position": "Junior System Architect",
          "from": "Wrzesień 2022",
          "to": "Maj 2023",
          "duties": {
            "duty1": "Tworzenie warstwy front-endowej panelu administratora przy użyciu React.js oraz Recoil.js.",
            "duty2": "Optymalizacja wydajności aplikacji oraz tworzenie testów jednostkowych dla React przy użyciu React Testing Library.",
            "duty3": "Przetwarzanie otrzymanych projektów w formacie PSD na interaktywne widoki użytkownika wykorzystując Vue.js.",
            "duty4": "Utrzymywanie czystego i czytelnego kodu, stosowanie najlepszych praktyk programistycznych oraz przestrzeganie standardów projektowych.",
            "duty5": "Współpraca z zespołem i udział w spotkaniach z klientem, aby zrozumieć wymagania dotyczące interfejsu użytkownika i funkcjonalności aplikacji.",
            "duty6": "Dokumentowanie wprowadzonych zmian i udokumentowanie postępów w projekcie."
          }
        },
        "previousPositionsDescription": "Zanim zająłem się programowaniem pracowałem na stanowiskach takich jak:",
        "prevPositions": {
          "supervisorsAssistant": "Asystent kierownika sklepu",
          "Salesman": "Sprzedawca",
          "Cashier": "Kasjer walutowy na lotnisku",
          "Buffer": "Buforowy",
          "ShiftCoordinator": "Koordynator zmiany"
        }
      },
      "description": {
        "p1": "Rozpocząłem swoją przygodę z programowaniem, pisząc skrypty do arkuszy Google Spreadsheets w Google Apps Script - frameworku JavaScript. Programowanie stało się moją prawdziwą pasją. Decyzja o zostaniu programistą była naturalnym krokiem na mojej ścieżce rozwoju.",
        "p2": "Posiadam już prawie dwuletnie doświadczenie komercyjne jako programista, które tylko utwierdziło mnie w przekonaniu, że programowanie to moja pasja na całe życie.",
        "p3": "Jestem pełen determinacji, aby znaleźć nowe, inspirujące środowisko pracy i kontynuować rozwijanie się jako programista, wkładając w projekty całe moje zaangażowanie i pasję."
      },
      "bootcamps": {
        "description": "Bootcampy, które ukończyłem w celu rozwoju umiejętności programistycznych:",
        "nextjsmasters": "Bootcamp o tworzeniu wydajnych i kompleksowych aplikacji przy użyciu Next.js oraz narzędzi takich jak Docker, AWS, GraphQL, Stripe , ze szczególnym naciskiem na e-commerce.",
        "megak": "12-miesięczny kurs nastawiony głównie na opanowanie podstaw technologi backendowych.",
        "coderscamp": "6-miesięczny, darmowy kurs programowania webowego, organizowany przez Stowarzyszenie CodersCrew.",
        "youcode": "Rozbudowany kurs frontendu od podstaw.",
        "codeme": "Stacjonarny 3 miesięczny kurs w Poznańskim oddziale szkoły CODE:ME.",
        "others": "Ukończyłem również liczne kursy online takich autorów jak:"
      }
    },
    "skills": {
      "language": "Język angielski - C1 w mowie i piśmie",
      "drivingLicense": "Prawo jazdy kat. B",
      "skill": {
        "wordpress": "Podstawy Wordpress",
        "php": "Podstawy php"
      },
      "sections": {
        "frontend": "Frontend",
        "backend": "Backend",
        "design": "Design",
        "devtools": "Narzędzia",
        "other": "Inne"
      }
    },
    "work": {
      "headers": {
        "folders": "Inne projekty własne warte pokazania"
      },
      "hint": "Kliknij w zdjęcie dwukrotnie aby przybliżyć / oddalić obraz",
      "projectsTitles": {
        "Shiftana": "Shiftana",
        "givemeart": "GiveMeArt",
        "trenujemyAdmin": "Trenujemy.pl - Panel Admina",
        "trenujemyUser": "Trenujemy.pl - Panele Użytkowników",
        "megaKRecruitment": "MegaK Rekrutacja",
        "movieWatcher": "Movie Watcher",
        "megaKOgłoszenia": "MegaK Ogłoszenia",
        "prezentyMikołaja": "Prezenty Mikołaja",
        "cookieMaker": "Cookie Maker",
        "randomValuePicker": "Random Value Picker",
        "kantorYoucode": "Youcode Kantor"
      },
      "projectsDescriptions": {
        "commercial": "Projekt komercyjny",
        "personal": "Projekt prywatny",
        "givemeart": "Projekt ten był moim debiutem jako freelancera oraz pierwszym profesjonalnym doświadczeniem w roli Web Designera i Developera Next.js. Byłem odpowiedzialny za zaprojektowanie całego interfejsu użytkownika, rozwój front-endu z użyciem Next.js i Tailwind CSS, oraz stworzenie kompleksowego systemu designu w Figmie, co zapewniło spójność i usprawniło proces rozwoju. Projekt GiveMeArt projekt mający na celu integrację generowania grafik opartych na AI z usługą print-on-demand.",
        "Shiftana": "Shiftana to aplikacja umożliwiająca szczegółowe zarządzanie harmonogramem pracy, dostępnością pracowników oraz raportowaniem wykonanej pracy.",
        "trenujemyAdmin": "Panel admina aplikacji trenujemy.pl. Umożliwia dodawanie posiłków, suplementów oraz ćwiczeń, a także tworzenie spersonalizowanych planów dietetycznych i treningowych dla użytkowników. Byłem odpowiedzialny za implementację interfejsu admina, zapewnienie responsywności oraz funkcjonalności.",
        "trenujemyUser": "Moja praca polegała na tworzeniu z otrzymanych projektów atrakcyjnych i funkcjonalnych widoków, które zapewniały wygodne i satysfakcjonujące doświadczenie użytkownikom aplikacji trenujemy.pl. Widoki użytkowników obejmowały przeglądanie posiłków, suplementów i ćwiczeń, spersonalizowanych planów dietetycznych i treningowych oraz monitorowanie postępów.",
        "megaKRecruitment": "Końcowy projekt grupowy bootcampu MegaK. Był okazją do nauki pracy zespołowej i zarządzania projektem. Celem było stworzenie serwisu rekrutacyjnego dla rekruterów, umożliwiającego oferowanie pracy absolwentom bootcampu MegaK. Odpowiedzialni byliśmy za projektowanie i implementację interfejsu użytkownika, systemu rejestracji i logowania oraz bazy danych.",
        "movieWatcher": "Inspirowana serwisem Netflix aplikacja z informacjami o filmach. Korzysta z 'The Movie Database' API. Więcej informacji znajdziesz na githubie projektu",
        "megaKOgłoszenia": "Aplikacja w formie serwisu ogłoszeniowego. Do wyświetlania mapy wykorzystano OpenStreetMap.",
        "prezentyMikołaja": "Aplikacja do tworzenia listy prezentów. Zrobiona w trakcie nauki technologi backendowych i zarządzania bazami danych.",
        "cookieMaker": "Aplikacja zrobiona w ramach kursu megaK. Zrobiona w celu nauki Server Side Rendering. Do renderowania użyto Handlebars",
        "randomValuePicker": "Prosta aplikacja wykonująca losowy wybór. Zrobiona podczas nauki React'a. więcej informacji na github.",
        "kantorYoucode": "Prosta aplikacja do konwertowania walut. Zrobiona w ramach bootcampu Youcode. więcej informacji na github."
      }
    },
    "contact": {
      "location": "Lokalizacja",
      "relocation": "Polska",
      "resume": "Pobierz CV",
      "polish": "j. polski",
      "english": "j. angielski",
      "ama": "Zadaj mi pytanie!",
      "copyrights": "© 2023 Michał Stępień"
    }
  }
}
