{
  "tooltips": {
    "settings": {
      "settings": "settings",
      "language": "select language",
      "theme": "select theme",
      "light": "light",
      "dark": "dark"
    }
  },
  "nav": {
    "sections": {
      "home": "Hello",
      "about": "About Me",
      "skills": "Skills",
      "work": "Work",
      "contact": "Contact"
    }
  },
  "sections": {
    "home": {
      "header": {
        "p1": "Hi, my name is",
        "p2": "As a junior web developer with nearly a year of commercial experience.",
        "p3": "Feel free to explore my ",
        "p4": " for a comprehensive understanding of my "
      },
      "links": {
        "skills": "skills",
        "projects": "projects"
      }
    },
    "about": {
      "description": {
        "p1": "I began my programming journey by writing scripts for Google Spreadsheets using Google Apps Script, which is based on the JavaScript framework. Programming has become my true passion. The decision to become a programmer was a natural step in my development path.",
        "p2": "I already have nearly a year of commercial experience as a programmer, which has only reinforced my belief that programming is my lifelong passion.",
        "p3": "Currently, my current project has come to an end, which is why I am seeking new employment. I am determined to find a new, inspiring work environment and continue to grow as a programmer, dedicating my full commitment and passion to projects."
      },
      "bootcamps": {
        "megak": "12-months long course aimed mainly at mastering the backend technologies.",
        "coderscamp": "6-months long, free of charge web development course organised by CodersCrew.",
        "youcode": "Comprehensive and well organised course covering all basics of front end development.",
        "codeme": "Stationary 3-month long course in CODE:ME school in their Poznań branch covering basics of javascript and React framework.",
        "others": "I have also finished many online courses by great authors, such as:"
      }
    }
  }
}